app/worker/send_email_worker.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def perform(user_id)
    user = User.find(user_id)