app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "john@example.com"], ["LIMIT", 1]]
---
	def login
		# debugger
		@user = User.find_by_email(params[:email])