app/controllers/comments_controller.rb

  def create
  	# byebug
  	# @current_user = @user
    @comment = Comment.new(comment_params)
    @comment.user = @current_user

    if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is the content of the comment"], ["post_id", 2], ["user_id", 1], ["created_at", "2024-02-23 11:11:44.062314"], ["updated_at", "2024-02-23 11:11:44.062314"]]

  def set_post
    begin
      # @post = Post.find(params[:id])
      @post = Post.find_by(id: params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]