app/controllers/posts_controller.rb

  def create
  	@post = @current_user.posts.build(title: params[:title], content: params[:content])

    # @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test again"], ["user_id", 1], ["created_at", "2024-02-23 09:47:13.749951"], ["updated_at", "2024-02-23 09:47:13.749951"]]

  def update
  	@current_user = @user
    if @post.update(title: params[:title], content: params[:content])
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "new"], ["updated_at", "2024-02-23 09:46:37.513170"], ["id", 1]]

	def destroy
	  if @post
	    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]