app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "mahi"], ["email", "mahi@gmail.com"], ["created_at", "2024-02-23 09:16:16.355573"], ["updated_at", "2024-02-23 09:16:16.355573"], ["password_digest", "[FILTERED]"]]
---
  def create
    # @user = User.new(user_params)
    @user = User.new(name: params[:name], email: params[:email], password: params[:password])


    if @user.save

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "mahi rathore"], ["updated_at", "2024-02-23 09:26:09.224348"], ["id", 1]]
---
  def update
  	@current_user = @user
    if @current_user&.update(name: params[:name])