app/jobs/send_emails_job.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def self.send_email_perameter(user)
    user = User.find(user.id)